app/controllers/playlists_controller.rb

INSERT INTO "playlists" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Title"], ["description", "Description"], ["created_at", "2020-11-17 15:19:50.650774"], ["updated_at", "2020-11-17 15:19:50.650774"]]
---
  def create
    @playlist = Playlist.new(playlist_params)

    if @playlist.save

DELETE FROM "playlists" WHERE "playlists"."id" = $1  [["id", 1]]
---
  def destroy
    @playlist.destroy