app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)
    @song.playlist_id = params[:playlist_id]

    if @song.save
---
INSERT INTO "songs" ("title", "artist", "time", "created_at", "updated_at", "playlist_id", "favorite") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Extra Luv"], ["artist", "Future"], ["time", "4:06"], ["created_at", "2020-11-17 19:47:59.758555"], ["updated_at", "2020-11-17 19:47:59.758555"], ["playlist_id", 12], ["favorite", false]]

  def update
    if @song.update(song_params)
---
UPDATE "songs" SET "favorite" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["favorite", false], ["updated_at", "2020-11-17 17:49:19.300029"], ["id", 6]]